--
-- PostgreSQL database dump
--

-- Dumped from database version 16.6
-- Dumped by pg_dump version 16.6

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

--
-- Data for Name: hot_stamping_type_options; Type: TABLE DATA; Schema: public; Owner: -
--

COPY public.hot_stamping_type_options (id, stamping_type, position_type, description, is_active, sort_order, created_at, updated_at, match_mode) FROM stdin;
9	有紋燙金	\N	有紋燙金工藝（默認）	t	9	2025-10-04 21:05:16.090038	2025-10-04 21:05:16.090038	OR
1	平面燙金	\N	平面燙金工藝（默認）	t	1	2025-10-04 21:05:16.090038	2025-11-19 17:31:43.180068	AND
2	平面燙金	於中間位	平面燙金工藝，在中間位置進行燙金	t	2	2025-10-04 21:05:16.090038	2025-11-19 17:31:46.318947	AND
3	平面燙金	到邊位	平面燙金工藝，燙金到邊緣位置	t	3	2025-10-04 21:05:16.090038	2025-11-19 17:31:48.891113	AND
5	磨砂燙金	\N	磨砂燙金工藝（默認）	t	5	2025-10-04 21:05:16.090038	2025-11-19 17:31:54.192275	AND
6	折光燙金	\N	折光燙金工藝（默認）	t	6	2025-10-04 21:05:16.090038	2025-11-19 17:31:59.363216	AND
4	立體燙金	\N	立體燙金工藝（默認）	t	4	2025-10-04 21:05:16.090038	2025-11-19 17:31:51.341131	AND
8	燙金後壓紋	\N	燙金後壓紋工藝（默認）	t	8	2025-10-04 21:05:16.090038	2025-10-04 21:05:16.090038	OR
7	燙金後擊凸	\N	燙金後擊凸工藝（默認）	t	7	2025-10-04 21:05:16.090038	2025-10-04 21:05:16.090038	OR
\.


--
-- Data for Name: material_catalog; Type: TABLE DATA; Schema: public; Owner: -
--

COPY public.material_catalog (id, material_code, material_name, supplier_model, test_no, supplier, category_type, category_id, design_limits, substrate_compat, is_active, sort_order, created_at, updated_at, material_usage) FROM stdin;
212	RMCL-AW	可移性玻璃面貼紙	RMCL-AW	P-MIS-110601	\N	paper	3	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	書版貼紙
213	AL-ADW	永久性粉面貼紙	AL-ADW	MIS-041022	\N	paper	3	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	書版貼紙
214	AL_80__Z120501_	永久性粉面貼紙	AL(80)(Z120501)	P-MIS-050807	\N	paper	3	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	書版貼紙
215	PL-WR	永久性書面貼紙	PL-WR	MIS-041023	\N	paper	3	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	書版貼紙
216	MCL-AW____	永久性玻璃面貼紙	MCL-AW(新色)	P-MIS-110602	\N	paper	3	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	書版貼紙
217	__UV_	1)咭書；\r\n2)硬盒\r\n3) W-O書\r\n4)騎釘書\r\n5)掛歷等\r\n6)銀銻紙做紙袋\r\n7)平裝書封面	普通UV油	HS16065	\N	printing_material	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
218	__UV__1	1)咭書；\r\n2)硬盒\r\n3) W-O書\r\n4)騎釘書\r\n5)掛歷等\r\n6)銀銻紙做紙袋\r\n7)平裝書封面	普通UV油	/	\N	printing_material	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
219	LED-UV_	普通用途，適用於：\r\n1)咭書；\r\n2)硬盒\r\n3) W-O書\r\n4)騎釘書\r\n5)掛歷等\r\n7)銀銻紙做紙袋\r\n8)《金莎T8》工程\r\n9)銀銻紙過UV做咭書\r\n10)平裝書封面	LED-UV油	/	\N	printing_material	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
220	___UV_	普通用途，適用於：\r\n1)咭書；\r\n2)硬盒\r\n3) W-O書\r\n4)騎釘書\r\n5)掛歷等	免打底UV油	/	\N	printing_material	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
221	_______UV_	針對用於：\r\n1)HM書袋產品	書袋專用半光啞UV油	/	\N	printing_material	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
222	___UV__1	針對用於：\r\n1)《金莎T8》工程\r\n2)銀銻紙過UV做咭書	高耐磨UV油	/	\N	printing_material	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
223	___UV__2	1.針對用PENUK01客戶	白板筆UV油	/	\N	printing_material	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
224	___UV__3	1.針對用於寫白板筆（包含〝酒精性白板筆〞、〝水性白板筆〞）；\r\n2、雙面過UV後需寫白板筆同時需要上折頁機工程；	白板筆UV油	/	\N	printing_material	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
225	___UV__4	針對用於：\r\n1.需燙金邊/銀邊/白邊/機掃色邊的產品；\r\n\r\n2.雙面過UV上折頁機工程\r\n\r\n3.針對用於UV面植毛工藝產品	耐高溫UV油		\N	printing_material	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
230	MAT_383a1685	常規粉紙面產品過光水油時使用\r\n（不能用於咭書產品，容易出現紅色滲墨問題）	印刷光水油	/	\N	printing_material	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
231	MAT_6aee1d31	常規粉紙面產品過光水油時使用	印刷光水油	/	\N	printing_material	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
232	MAT_89a4533a	常規粉紙面產品過光水油時使用	印刷光水油	/	\N	printing_material	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
233	MAT_a601fde0	耐磨光水油\r\n產品容易磨花或客人對耐磨要求高的產品使用	印刷光水油	/	\N	printing_material	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
234	MAT_243d3e71	絲印局光UV專用光水油	印刷光水油	/	\N	printing_material	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
235	MAT_2cb81228	印刷敏感油墨防變色使用	印刷光水油	/	\N	printing_material	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
236	MAT_524f0076	耐高溫光水油	印刷光水油	/	\N	printing_material	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
237	MAT_6c5e0805	水油紙袋防爆色使用	印刷彈性光水油	/	\N	printing_material	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
238	MAT_da88160f	印刷時深印刷防龜裂現象使用，添加量為20~25%	印刷彈性光水油	/	\N	printing_material	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
241	MAT_5043a73e	低滑度要求(如LDP-保劑丸)	印刷光水油	/	\N	printing_material	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
242	MAT_ed745997	常規粉紙面產品過啞水油時使用	印刷啞水油	/	\N	printing_material	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
243	MAT_0e343aa8	常規粉紙面產品過光水油時使用\r\n（不能用於咭書產品，容易出現紅色滲墨問題）	印刷啞水油	/	\N	printing_material	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
244	MAT_8ee3bacc	常規粉紙面產品過啞水油時使用	印刷啞水油	/	\N	printing_material	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
245	MAT_fbb1eaf9	印刷敏感油墨防變色使用	印刷啞水油	/	\N	printing_material	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
246	MAT_8f4c4aec	耐高溫啞水油	印刷啞水油	/	\N	printing_material	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
247	MAT_aadc9073	HM紅色折盒專用	印刷啞水油		\N	printing_material	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
248	MAT_db57223f	低啞度水油	印刷啞水油	/	\N	printing_material	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
249	MAT_fd602221	低啞度水油	印刷啞水油	/	\N	printing_material	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
158	MAT_6c27fb0d	普通光膠			\N	lamination	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	BOPP
159	MAT_5c0f0106	預塗光膠			\N	lamination	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	BOPP
229	MAT_5c0b6a57	針對用於：\r\n1)手工毛布咭書：<<童謠觸摸書>>、<<寶寶觸摸平裝咭書>>、CO22007276<<運動咭書>>的翻單；\r\n2)封面過UV且厚度小於6mm咭書；\r\n3)<<開心樂園咭書系列>>；	離線抗爆線底油	/	\N	printing_material	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
160	MAT_fa8bf52c	預塗光膠			\N	lamination	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	BOPP
161	MAT_0b5dce59	超粘預塗光膠			\N	lamination	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	BOPP
162	MAT_ecc77e16	水性單面電暈光膠			\N	lamination	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	BOPP
163	MAT_11c74115	預塗單面電暈光膠			\N	lamination	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	BOPP
164	MAT_3d6d8445	水性尼龍光膠			\N	lamination	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	BOPA
165	MAT_3c4c8089	預塗尼龍光膠			\N	lamination	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	BOPA
166	MAT_eeeb56d2	水性PET光膠			\N	lamination	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	PET
167	MAT_a4aa1f3c	預塗PET光膠			\N	lamination	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	PET
168	MAT_62625ffc	預塗PET光膠			\N	lamination	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	PET
169	MAT_f1e0e670	預塗抗靜電光膠			\N	lamination	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	BOPP
170	MAT_c4a9542c	水性耐磨光膠			\N	lamination	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	BOPP
171	MAT_236ad458	預塗耐磨光膠			\N	lamination	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	BOPP
172	MAT_580a4b3c	普通啞膠			\N	lamination	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	BOPP
173	MAT_4b562f62	預塗啞膠			\N	lamination	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	BOPP
174	MAT_785ab697	預塗啞膠			\N	lamination	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	BOPP
175	MAT_3da216bd	超粘預塗啞膠			\N	lamination	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	BOPP
176	MAT_06b5fef6	預塗普通耐磨啞膠\r\n（耐磨性能：2磅50次有輕微磨花）			\N	lamination	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	BOPP
177	MAT_d291570a	預塗平價高耐磨啞膠\r\n（耐磨性能：4磅50次無磨花）			\N	lamination	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	BOPP
178	MAT_0181f193	預塗高耐磨啞膠\r\n（耐磨性能：4磅50次無磨花）			\N	lamination	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	BOPP
179	MAT_ddac9136	預塗抗靜電啞膠			\N	lamination	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	BOPP
180	MAT_a06e5d02	透明鐳射菲林			\N	lamination	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	PET
181	HAL#2R_BL__Z140208_	可移性粉面貼紙	HAL#2R(BL)(Z140208)	P-MIS-140502	\N	paper	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	平面標籤
182	HAL#2R_BL__Z140206_	可移性粉面貼紙	HAL#2R(BL)(Z140206)	P-MIS-140502	\N	paper	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	平面標籤
183	HAL#3R	可移性粉面貼紙	HAL#3R	P-MIS-050801	\N	paper	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	平面標籤
184	ALJ-CLR22-BG65	可移性粉面貼紙	ALJ-CLR22-BG65	P-MIS-180601	\N	paper	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	平面標籤
185	HAL_Z140403_	永久性粉面貼紙	HAL(Z140403)	P-MIS-050807	\N	paper	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	平面標籤
186	HAL_FS__Z230703_	永久性粉面貼紙	HAL(FS)(Z230703)	P-231001	\N	paper	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	平面標籤
187	HAL-FS-EA-Z231101	永久性粉面貼紙	HAL-FS-EA-Z231101\r\n壓紋底	P-231001	\N	paper	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	平面標籤\r\n（光滑面排氣標）
188	HAL128_D190606_	永久性粉面貼紙	HAL128(D190606)	P-230301	\N	paper	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	平面標籤
189	HPL#S_FS__Z230406_	永久性書面貼紙	HPL#S(FS)(Z230406)	P-231001	\N	paper	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	平面標籤
190	HTLT#3R_BL__Z151102_	可移性透明PET貼紙	HTLT#3R(BL)(Z151102)	MIS-041212	\N	paper	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	非平面\r\n標籤
191	HTLH#5R-C41K-Z210505	可移性透明PET貼紙	HTLH#5R-C41K-Z210505	GSCM21073102	\N	paper	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	非平面\r\n標籤
192	#3R_T__P2201029_	可移性透明纖維素\r\n薄膜貼紙	#3R(T)(P2201029)	/	\N	paper	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	非平面\r\n標籤
193	HAL#2R_BL__Z140206__1	可移性粉面貼紙	HAL#2R(BL)(Z140206)	P-MIS-140502	\N	paper	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	非平面\r\n標籤
194	HAL#3R_1	可移性粉面貼紙	HAL#3R	P-MIS-050801	\N	paper	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	非平面\r\n標籤
195	ALJ-CLR22-BG65_1	可移性粉面貼紙	ALJ-CLR22-BG65	P-MIS-180601	\N	paper	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	非平面\r\n標籤
196	HTLT_Z190202_	永久性透明PET貼紙	HTLT(Z190202)	/	\N	paper	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	非平面\r\n標籤
197	KL-175_33W__Z221203_	永久性透明纖維素\r\n薄膜貼紙	KL-175(33W)(Z221203)	/	\N	paper	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	非平面\r\n標籤
198	___-CF23-WG80	永久性纖維紙面貼紙	纖維紙-CF23-WG80	/	\N	paper	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	非平面\r\n標籤
199	HAL_FS__Z230703__1	永久性粉面貼紙	HAL(FS)(Z230703)	/	\N	paper	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	非平面\r\n標籤
200	HAL128_D190606__1	永久性粉面貼紙	HAL128(D190606)	/	\N	paper	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	非平面\r\n標籤
201	HPL#S_FS__Z230406__1	永久性書面貼紙	HPL#S(FS)(Z230406)	/	\N	paper	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	非平面\r\n標籤
202	AL_T_-RR26-CCK90	可移性粉面貼紙	AL(T)-RR26-CCK90	客人指定使用	\N	paper	3	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	書版貼紙
203	AL_CL79_CCK80	可移性粉面貼紙	AL/CL79/CCK80	P-230401	\N	paper	3	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	書版貼紙
204	AL_CD22_CCK80	可移性粉面貼紙	AL/CD22/CCK80	P-230402	\N	paper	3	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	書版貼紙
205	RAL-BW-2293	可移性粉面貼紙	RAL-BW-2293	P-MIS-140102	\N	paper	3	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	書版貼紙
206	RAL-BW-2293_1	可移性粉面貼紙	RAL-BW-2293		\N	paper	3	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	書版貼紙
207	RAL-CCK-2293	可移性粉面貼紙	RAL-CCK-2293		\N	paper	3	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	書版貼紙
208	AL#2R_FS2__Z250702_	可移性粉面貼紙	AL#2R(FS2)(Z250702)	P-MIS-140501	\N	paper	3	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	書版貼紙
209	AL#2R_FS2__Z230601_	可移性粉面貼紙	AL#2R(FS2)(Z230601)	P-MIS-140502	\N	paper	3	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	書版貼紙
210	AL#2R_Z140206_	可移性粉面貼紙	AL#2R(Z140206)		\N	paper	3	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	書版貼紙
211	PL#2R_FS2__Z240302_	可移性書面貼紙	PL#2R(FS2)(Z240302)	P-MIS-140501	\N	paper	3	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	書版貼紙
250	MAT_3089d719	低啞度水油	印刷啞水油	/	\N	printing_material	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
251	MAT_19ea34dd	HM粉面專用啞水油	印刷啞水油	/	\N	printing_material	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
252	MAT_1b37086a	≧100gsm/m2無粉紙類(書紙、無粉咭、牛皮紙、花紙、布紋紙)	印刷半光啞水油	/	\N	printing_material	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
253	MAT_14d36181	≧100gsm/m2無粉紙類(書紙、無粉咭、牛皮紙、花紙、布紋紙)	印刷半光啞水油	/	\N	printing_material	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
254	MAT_a5ac9fc7	≧100gsm/m2無粉紙類(書紙、無粉咭、牛皮紙、花紙、布紋紙)掃金粉專用	印刷半光啞水油	/	\N	printing_material	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
255	MAT_1ab11c1f	抗靜電預塗膜,若過膠前需過油,則選用#8150	印刷過膠底油	/	\N	printing_material	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
256	__UV__	UV油上光前打底用	印刷UV底油	/	\N	printing_material	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
257	__UV___1	UV油上光前打底用	印刷UV底油	/	\N	printing_material	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
258	__UV___2	UV油上光前打底用	印刷UV底油	/	\N	printing_material	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
259	__UV___3	UV油上光前打底用（燙金面過UV專用）	印刷UV底油	/	\N	printing_material	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
260	MAT_d19306c2	過膠產品，連線上光保護，防蹭花(如：掃金粉、金屬油墨印刷後過膠)	印刷過膠底油	/	\N	printing_material	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
261	__UV___4	UV油上光前打底用，防爆色	印刷UV底油	/	\N	printing_material	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
262	MAT_d2a65334	吸塑產品	印刷吸塑油	/	\N	printing_material	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
263	MAT_72a1e167	開窗覆膜類產品(如金莎、中華煙盒等)	印刷吸塑油	/	\N	printing_material	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
264	MAT_a6d506a3	代替過光膠	去塑光水油	/	\N	printing_material	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
265	MAT_8d413bcc	代替過啞膠	去塑啞水油	/	\N	printing_material	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
266	MAT_6aa8d587	配合去塑光/啞油	連線防爆底油（配合去塑光/啞油）	/	\N	printing_material	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
267	MAT_76381c92	羅全	水油溝珍珠粉\r\n作絲印掃金粉工藝使用	#WBL-902C\r\n(配套3%#C-02水性慢乾劑)	\N	screen_printing_uv	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	手落機：50.8 X 127
268	__LED_UV_	絲印LED UV灑閃粉	絲印LED UV油	/	\N	screen_printing_uv	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
269	MAT_39739e7e	絲印LED UV灑閃粉(溝油墨)			\N	screen_printing_uv	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	
270	__LED_UV__1	多色灑閃粉	絲印LED UV油	/	\N	screen_printing_uv	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	
271	MAT_c1da1f01	漸變灑閃粉			\N	screen_printing_uv	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	
272	__LED_UV__2	絲印有色UV灑閃粉(HM-Snow Flitter)\r\n配對閃粉：#C22-3B彩虹閃粉	有色LED UV油	/	\N	screen_printing_uv	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
273	__UV___5	第二加工工藝	絲印UV光油		\N	screen_printing_uv	3	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	透明色
274	__UV___6	第二加工工藝	絲印UV光油		\N	screen_printing_uv	3	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	透明色
275	__UV___7	第二加工工藝	絲印UV光油		\N	screen_printing_uv	3	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	透明色
276	__UV___8	第二加工工藝	絲印UV光油		\N	screen_printing_uv	3	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	透明色
277	__UV___9	第二加工工藝	絲印UV光油	/	\N	screen_printing_uv	4	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
278	__UV___10	第二加工工藝	絲印UV光油		\N	screen_printing_uv	4	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
279	__UV___11	第二加工工藝	絲印UV光油		\N	screen_printing_uv	4	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
280	__UV___12	第二加工工藝	絲印UV光油		\N	screen_printing_uv	4	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
281	__UV___13	第二加工工藝	絲印UV光油		\N	screen_printing_uv	4	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
282	__UV___14	第二加工工藝	絲印UV光油		\N	screen_printing_uv	4	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
283	MAT_b9aa95ae	第二加工工藝	絲印水性光油		\N	screen_printing_uv	4	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
284	MAT_69443cda	第二加工工藝	絲印水性光油		\N	screen_printing_uv	4	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
285	__UV___15	第二加工\r\n非吸收性界面/啞膠類/啞水油類\r\n作局部絲印UV上光功能	絲印UV光油	/	\N	screen_printing_uv	5	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	書本\r\n盒\r\n賀咭\r\n紙袋\r\n\r\n封面加工為主
286	__UV___16	第二加工\r\n非吸收性界面印刷過油類\r\n作局部絲印UV上光功能	絲印UV光油		\N	screen_printing_uv	5	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	書本
287	__UV___17	第二加工\r\n吸收性界面\r\n作局部絲印UV上光功能	絲印UV光油	/	\N	screen_printing_uv	5	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	書本\r\n盒\r\n賀咭\r\n紙袋
288	__UV___18	第二加工\r\n非吸收性界面\r\n作局部絲印UV上光功能	絲印UV光油	/	\N	screen_printing_uv	5	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	包裝盒類
289	__UV___19	第二加工\r\n絲印局部UV加工\r\n包裝產品- 《百齡壇-木盒系列》-低光度要求專用	絲印UV光油	/	\N	screen_printing_uv	5	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	包裝盒類
290	__UV___20	第二加工\r\n非吸收性界面\r\n作局部絲印UV上光功能	絲印UV光油	/	\N	screen_printing_uv	5	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	包裝盒類
291	__UV___21	第二加工\r\n啞膠類界面\r\n作局部絲印UV上光功能	絲印UV光油	/	\N	screen_printing_uv	5	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	盒\r\n書本\r\n紙袋
292	#UVH-____	此工藝為物料的表面張力收縮而形成橘皮紋路效果	#UVH-皮紋油墨		\N	screen_printing_uv	6	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	/
294	___UV	第二加工工藝	絲印啞UV	/	\N	screen_printing_uv	8	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
295	___UV_1	第二加工工藝\r\n(針對HM-賀咭燙金面)	絲印啞UV	/	\N	screen_printing_uv	8	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
296	___UV_2	第二加工工藝\r\n(針對寫粉筆字功能)	絲印啞UV	/	\N	screen_printing_uv	8	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
297	MAT_da5de229	第二加工工藝	絲印遇水變透明\r\n油墨	/	\N	screen_printing_uv	9	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	白色
298	__UV___22	第二加工工藝	絲印UV黑墨		\N	screen_printing_uv	9	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	黑色
299	____UV_	第二加工工藝	絲印皺紋UV油	/	\N	screen_printing_uv	13	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
300	____UV__1	第二加工工藝	絲印磨砂UV油	/	\N	screen_printing_uv	13	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
302	__UV___23	第二加工工藝	絲印UV光油	/	\N	screen_printing_uv	11	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
303	__UV___24	第二加工工藝	絲印UV光油		\N	screen_printing_uv	11	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
304	__UV___25	第二加工工藝	絲印UV光油		\N	screen_printing_uv	11	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
226	______UV_	1.功能與AM-8828UV油相同(僅氣味降低)\r\n\r\n2.針對低氣味要求客戶產品使用(對氣味敏感客戶PENGUIN BOOKS使用)，如S1736550<PP豬白板筆膠袋套裝(6本)>工程客人	低氣味白板筆UV油	/	\N	printing_material	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
227	___UV__5	針對用於：\r\n需同時出現下列情況的產品：\r\na.客人選用的金紙不適合做燙後過UV；\r\nb.客人又不接受轉用其他金紙(即是可燙後過UV的金紙)；\r\nc.且燙金線條細於3mm不適合作偷油處理的印件(原因：細於3mm偷位易出現套位不正的問題)；\r\nd.對燙金附著力要求不高的印件	可燙金UV油	/	\N	printing_material	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
228	_____UV__	針對用於：\r\n1)平裝書封面過UV油\r\n\r\n2)扇形/風琴咭書類過UV工程如S1503325<<藍色之旅>>\r\n\r\n3)針對防爆色要求高的工程如S1508343<<趣味滑道咭書>>\r\n\r\n4)針對過UV咭書產品用紙為啤線爆色數據為預警、高危，需過防爆色UV底油PC-8061(離線)；\r\n\r\n4)揭頁/沖牀咭書需過防爆色UV底油PC-8061(離線)；	離線防爆色UV底油	/	\N	printing_material	1	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
239	MAT_2865abdd	白麪牛咭M1F125、SKF125白麪牛咭防彎翹使用	印刷光水油	/	\N	printing_material	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
240	MAT_80fe1193	白麪牛咭M1F125、SKF125白麪牛咭防彎翹使用	印刷光水油	/	\N	printing_material	2	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	油類
293	__UV	第二加工工藝「絲印巖石UV」專用。\r\n\r\n物料經絲印於紙張上，其塗層具有獨特的立體粗糙磨砂手感效果。	巖石UV		\N	screen_printing_uv	7	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	/
301	MAT_e56a50ba	作水彩塗畫的趣味應用功能。	水彩墨	/	\N	screen_printing_uv	10	\N	\N	t	0	2026-05-11 10:25:47.038811	2026-05-11 10:25:47.038811	/
\.


--
-- Data for Name: product_type_options; Type: TABLE DATA; Schema: public; Owner: -
--

COPY public.product_type_options (id, product_name, display_order, is_active, description, created_at, updated_at) FROM stdin;
1	精平裝/咭書/綜合	1	t	精平裝及咭書類產品	2025-10-04 18:41:00.148116	2025-10-21 22:28:16.460462
2	賀咭	2	t	賀咭類產品	2025-10-04 18:41:00.148116	2026-02-12 10:41:33.523211
5	紙袋	3	t	紙袋類產品	2026-02-12 10:41:59.159279	2026-02-12 10:42:06.634629
3	包裝	4	t	包裝類產品	2025-10-04 18:41:00.148116	2026-02-12 10:42:12.7252
\.


--
-- Name: hot_stamping_type_options_id_seq; Type: SEQUENCE SET; Schema: public; Owner: -
--

SELECT pg_catalog.setval('public.hot_stamping_type_options_id_seq', 9, true);


--
-- Name: material_catalog_id_seq; Type: SEQUENCE SET; Schema: public; Owner: -
--

SELECT pg_catalog.setval('public.material_catalog_id_seq', 304, true);


--
-- Name: product_type_options_id_seq; Type: SEQUENCE SET; Schema: public; Owner: -
--

SELECT pg_catalog.setval('public.product_type_options_id_seq', 5, true);


--
-- PostgreSQL database dump complete
--

